backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  - [input_2, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 50, 50]
      dtype: float32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 50]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Embedding
        config:
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, 50]
          dtype: float32
          embeddings_constraint: null
          embeddings_initializer:
            class_name: RandomUniform
            config: {maxval: 0.05, minval: -0.05, seed: null}
          embeddings_regularizer: null
          input_dim: 33
          input_length: 50
          mask_zero: true
          name: embedding_2
          output_dim: 25
          trainable: true
      name: time_distributed_1
      trainable: true
    inbound_nodes:
    - - - input_2
        - 0
        - 0
        - {}
    name: time_distributed_1
  - class_name: Embedding
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 50]
      dtype: float32
      embeddings_constraint: null
      embeddings_initializer:
        class_name: RandomUniform
        config: {maxval: 0.05, minval: -0.05, seed: null}
      embeddings_regularizer: null
      input_dim: 431
      input_length: 50
      mask_zero: true
      name: embedding_1
      output_dim: 25
      trainable: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: embedding_1
  - class_name: TimeDistributed
    config:
      layer:
        class_name: LSTM
        config:
          activation: tanh
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dropout: 0.0
          go_backwards: false
          implementation: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: lstm_1
          recurrent_activation: hard_sigmoid
          recurrent_constraint: null
          recurrent_dropout: 0.02
          recurrent_initializer:
            class_name: Orthogonal
            config: {gain: 1.0, seed: null}
          recurrent_regularizer: null
          return_sequences: false
          return_state: false
          stateful: false
          trainable: true
          unit_forget_bias: true
          units: 30
          unroll: false
          use_bias: true
      name: time_distributed_2
      trainable: true
    inbound_nodes:
    - - - time_distributed_1
        - 0
        - 0
        - {}
    name: time_distributed_2
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - embedding_1
        - 0
        - 0
        - &id001 {}
      - - time_distributed_2
        - 0
        - 0
        - *id001
    name: concatenate_1
  - class_name: SpatialDropout1D
    config: {name: spatial_dropout1d_1, noise_shape: null, rate: 0.01, seed: null,
      trainable: true}
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: spatial_dropout1d_1
  - class_name: Bidirectional
    config:
      layer:
        class_name: LSTM
        config:
          activation: tanh
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dropout: 0.0
          go_backwards: false
          implementation: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: lstm_2
          recurrent_activation: hard_sigmoid
          recurrent_constraint: null
          recurrent_dropout: 0.02
          recurrent_initializer:
            class_name: Orthogonal
            config: {gain: 1.0, seed: null}
          recurrent_regularizer: null
          return_sequences: true
          return_state: false
          stateful: false
          trainable: true
          unit_forget_bias: true
          units: 30
          unroll: false
          use_bias: true
      merge_mode: concat
      name: bidirectional_1
      trainable: true
    inbound_nodes:
    - - - spatial_dropout1d_1
        - 0
        - 0
        - {}
    name: bidirectional_1
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config:
          activation: softmax
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: dense_3
          trainable: true
          units: 75
          use_bias: true
      name: time_distributed_3
      trainable: true
    inbound_nodes:
    - - - bidirectional_1
        - 0
        - 0
        - {}
    name: time_distributed_3
  name: model_1
  output_layers:
  - [time_distributed_3, 0, 0]
keras_version: 2.2.2
